shehabeldinkhalid-BioMedecailEng/IOT-C-M/SW/ATMEGA640-DRIVERS/HAL/AFE4490_REG.h
#ifndef AFE4490_REG_H_
#define AFE4490_REG_H_

/* AFE4490 INTERNAL register addresses.
 * These are NOT ATmega640 registers.
 */
#define AFE4490_CONTROL0        0x00
#define AFE4490_LED2STC         0x01
#define AFE4490_LED2ENDC        0x02
#define AFE4490_LED2LEDSTC      0x03
#define AFE4490_LED2LEDENDC     0x04
#define AFE4490_ALED2STC        0x05
#define AFE4490_ALED2ENDC       0x06
#define AFE4490_LED1STC         0x07
#define AFE4490_LED1ENDC        0x08
#define AFE4490_LED1LEDSTC      0x09
#define AFE4490_LED1LEDENDC     0x0A
#define AFE4490_ALED1STC        0x0B
#define AFE4490_ALED1ENDC       0x0C
#define AFE4490_LED2CONVST      0x0D
#define AFE4490_LED2CONVEND     0x0E
#define AFE4490_ALED2CONVST     0x0F
#define AFE4490_ALED2CONVEND    0x10
#define AFE4490_LED1CONVST      0x11
#define AFE4490_LED1CONVEND     0x12
#define AFE4490_ALED1CONVST     0x13
#define AFE4490_ALED1CONVEND    0x14
#define AFE4490_ADCRSTSTCT0     0x15
#define AFE4490_ADCRSTENDCT0    0x16
#define AFE4490_ADCRSTSTCT1     0x17
#define AFE4490_ADCRSTENDCT1    0x18
#define AFE4490_ADCRSTSTCT2     0x19
#define AFE4490_ADCRSTENDCT2    0x1A
#define AFE4490_ADCRSTSTCT3     0x1B
#define AFE4490_ADCRSTENDCT3    0x1C
#define AFE4490_PRPCOUNT        0x1D
#define AFE4490_CONTROL1        0x1E
#define AFE4490_SPARE1          0x1F
#define AFE4490_TIAGAIN         0x20
#define AFE4490_TIA_AMB_GAIN    0x21
#define AFE4490_LEDCNTRL        0x22
#define AFE4490_CONTROL2        0x23
#define AFE4490_SPARE2          0x24
#define AFE4490_SPARE3          0x25
#define AFE4490_SPARE4          0x26
#define AFE4490_RESERVED1       0x27
#define AFE4490_RESERVED2       0x28
#define AFE4490_ALARM           0x29
#define AFE4490_LED2VAL         0x2A
#define AFE4490_ALED2VAL        0x2B
#define AFE4490_LED1VAL         0x2C
#define AFE4490_ALED1VAL        0x2D
#define AFE4490_LED2MINUSALED2VAL 0x2E
#define AFE4490_LED1MINUSALED1VAL 0x2F
#define AFE4490_DIAG            0x30

/* CONTROL0 bits */
#define AFE4490_CONTROL0_SPI_READ  12
#define AFE4490_CONTROL0_TIM_COUNT_RST 13
#define AFE4490_CONTROL0_DIAG_EN   14
#define AFE4490_CONTROL0_SW_RST    15

#endif
